export type ManqusMoulidMalayalamItem = {
  id: number;
  text: string;
  start: number;
  end: number;
};

export const ManqusmoulidMalayalam: ManqusMoulidMalayalamItem[] = [
  {
    id: 1,
    text: "പരമകാരുണികനും അത്യന്തം കരുണയുള്ളവനുമായ അല്ലാഹുവിന്റെ നാമത്തിൽ.",
    start: 0,
    end: 1,
  },
  {
    id: 2,
    text: "റബീഉൽ അവ്വൽ മാസത്തിൽ ഹിദായത്തിന്റെ നബി ﷺയെ ചന്ദ്രനുപോലെ ഉദിപ്പിക്കുകയും, ലോകങ്ങൾ സൃഷ്ടിക്കപ്പെടുന്നതിന് മുമ്പേ അദ്ദേഹത്തിന്റെ നൂറിനെ സൃഷ്ടിക്കുകയും ചെയ്ത അല്ലാഹു മഹത്വപ്പെട്ടവനാണ്.",
    start: 1,
    end: 2,
  },
  {
    id: 3,
    text: "അല്ലാഹു അദ്ദേഹത്തിന് മുഹമ്മദ് എന്ന് നാമകരണം ചെയ്തു; നിശ്ചയിക്കപ്പെട്ട സമയത്ത് ലോകത്തേക്ക് അയച്ചു; മറ്റാരും അണിയിക്കാത്ത സൗന്ദര്യത്തിന്റെ അങ്കി അദ്ദേഹത്തിന് അണിയിച്ചു.",
    start: 2,
    end: 3,
  },
  {
    id: 4,
    text: "അദ്ദേഹത്തെ വഴിയാക്കി ആദം (അ) പ്രാർത്ഥിച്ചു; അദ്ദേഹത്തിലൂടെ നൂഹ് (അ) സഹായം തേടി; ഇബ്രാഹീം (അ)യുടെ വംശത്തിൽ അദ്ദേഹം നിലനിന്നു.",
    start: 3,
    end: 4,
  },
  {
    id: 5,
    text: "നിങ്ങളിൽ നിന്നുതന്നെ ഒരു ദൂതൻ നിങ്ങളിലേക്കു വന്നിരിക്കുന്നു. നിങ്ങൾക്ക് പ്രയാസം വരുന്നത് അവനെ വേദനിപ്പിക്കുന്നു. അവൻ നിങ്ങളെക്കുറിച്ച് അത്യന്തം കരുതലുള്ളവനും, വിശ്വാസികളോട് അത്യധികം കരുണയും ദയയും ഉള്ളവനുമാണ്.",
    start: 4,
    end: 5,
  },
];
