export type AdhkarItem = {
  id: number;
  text: string;
  start: number;
  end: number;
};

export const haddad: AdhkarItem[] = [
  {
    id: 1,
    text: `الى حضرتي روحي نبينا مصطفىنا محمد صلى الله عليه وسلم الْفَاتِحَة
أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيمِ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ الرَّحْمَنِ الرَّحِيمِ مَالِكِ يَوْمِ الدِّينِ إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ آمِينْ`,
    start: 0,
    end: 35,
  },
  {
    id: 2,
    text: `بِسْمِ اللّهِ الرَّحْمَنِ الرَّحِيمِ الم ذَلِكَ الْكِتَابُ لاَ رَيْبَ فِيهِ هُدًى لِّلْمُتَّقِينَ الَّذِينَ يُؤْمِنُونَ بِالْغَيْبِ وَيُقِيمُونَ الصَّلاَةَ وَمِمَّا رَزَقْنَاهُمْ يُنفِقُونَ وَالَّذِينَ يُؤْمِنُونَ بِمَا أُنزِلَ إِلَيْكَ وَمَا أُنزِلَ مِن قَبْلِكَ وَبِالْآخِرَةِ هُمْ يُوقِنُونَ أُوْلَـئِكَ عَلَى هُدًى مِّن رَّبِّهِمْ وَأُوْلَـئِكَ هُمُ الْمُفْلِحُونَ`,
    start: 35,
    end: 61,
  },
  {
    id: 3,
    text: `وَإِلَـهُكُمْ إِلَهٌ وَاحِدٌ لاَّ إِلَهَ إِلاَّ هُوَ الرَّحْمَنُ الرَّحِيمُ`,
    start: 61,
    end: 66,
  },
  {
    id: 4,
    text: `اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ`,
    start: 66,
    end: 90,
  },
  {
    id: 5,
    text: 'لِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الأرْضِ وَإِنْ تُبْدُوا مَا فِي أَنْفُسِكُمْ أَوْ تُخْفُوهُ يُحَاسِبْكُمْ بِهِ اللَّهُ فَيَغْفِرُ لِمَنْ يَشَاءُ وَيُعَذِّبُ مَنْ يَشَاءُ وَاللَّهُ عَلَى كُلِّ شَيْءٍ قَدِيرٌ.',
    start: 90,
    end: 105,
  },
  {
    id: 6,
    text: 'آمَنَ الرَّسُولُ بِمَا أُنزِلَ إِلَيْهِ مِن رَّبِّهِ وَالْمُؤْمِنُونَ كُلٌّ آمَنَ بِاللّهِ وَمَلآئِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لاَ نُفَرِّقُ بَيْنَ أَحَدٍ مِّن رُّسُلِهِ وَقَالُواْ سَمِعْنَا وَأَطَعْنَا غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ* لاَ يُكَلِّفُ اللّهُ نَفْسًا إِلاَّ وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لاَ تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلاَ تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا رَبَّنَا وَلاَ تُحَمِّلْنَا مَا لاَ طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَآ أَنتَ مَوْلاَنَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ.',
    start: 105,
    end: 147,
  },
  {
    id: 7,
    text: 'لَا إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لَا شَرِيْكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِي وَيُمِيتُ وَهُوَ عَلَىَ كُلِّ شَيْئٍ قَدِيْرٌ (3)' ,
    start: 147,
    end: 169,
  },
  {
    id: 8,
    text:'سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَلَا إِلَهَ إِلاَّ اللَّهُ وَاللَّهُ أَكْبَرُ(3)',
    start: 169,
    end: 184,
  },
  {
    id: 9,
    text: 'سُبْحَانَ اللَّهِ وَبِحَمْدِهِ سُبْحَانَ اللَّهِ الْعَظِيْمِ (3)',
    start: 184,
    end: 195,
  },
  {
    id: 10,
    text: 'رَبَّنَا اغْفِرْ لَنَا وَتُبْ عَلَيْنَا إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ (3)',
    start: 195,
    end: 207,
  },
  {
    id: 11,
    text: 'اللَّهُمَّ صَلِّ عَلَى مُحَمَّدْ. اَللَّهُمَّ صَلِّ عَلَيْهِ وَسَلِّمْ (3)',
    start: 207,
    end: 219,
  },
  {
    id: 12,
    text: 'أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ (3)',
    start: 219,
    end: 231,
  },
  {
    id: 13,
    text: 'بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْئٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيْعُ الْعَلِيْمُ (3)',
    start: 231,
    end: 249,
  },
  {
    id: 14,
    text:'رَضِينَا بِاللَّهِ رَبًّا وَبِالْإِسْلاَمِ دِيْنًا وَبِمُحَمَّدٍ نَبِيًّا(3)',
    start: 249,
    end: 262,
  },
  {
    id: 15,
    text:'بِسْمِ اللَّهِ وَالْحَمْدُ لِلَّهِ  اَلْخَيْرُ وَالشَّرُّ بِمَشِيئَةِ اللَّهِ (3)',
    start: 262,
    end: 275,
  },
  {
    id: 16,
    text:'آمَنَّا بِاللَّهِ وَالْيَوْمِ الآخِرِ تُبْنَا إِلَى اللَّهِ بَاطِنًا وَظَاهِرْ (3)',
    start: 275,
    end: 288,
  },
  {
    id: 17,
    text:'يَا رَبَّنَا وَاعْفُ عَنَّا وَامْحُ الَّذِي كَانَ مِنَّا(3)',
    start: 288,
    end: 297,
  },
  {
    id: 18,
    text:'يَا ذَا الْجَلَالِ وَالْإِكْرَامِ أَمِتْنَا عَلَى دِيْنِ الْإِسْلاَمِ (7)',
    start: 297,
    end: 318,
  },
  {
    id: 19,
    text:'يَا قَوِيُّ يَا مَتِينُ اكْفِ شَرَّ الظَّالِمِينَ (3)',
    start: 318,
    end: 327,
  },
  {
    id: 20,
    text:'أَصْلَحَ اللَّهُ أُمُورَ الْمُسْلِمِينَ صَرَفَ اللَّهُ شَرَّ الْمُؤْذِينَ (3)',
    start: 327,
    end: 336,
  },
  {
    id: 21,
    text: 'يَا عَلِيُّ يَا كَبِيرُ يَا عَلِيمُ يَا قَدِيرُ يَا سَمِيعُ يَا بَصِيرُ يَا لَطِيفُ يَا خَبِيرُ (3)',
    start: 336,
    end: 352,
  },
  {
    id: 22,
    text: 'يَا فَارِجَ الْهَمِّ وَيَا كَاشِفَ الْغَمِّ يَا مَنْ لِعَبْدِهِ يَغْفِرُ وَيَرْحَمُ (3)',
    start: 352,
    end: 364,
  },
  {
    id: 23,
    text: 'أَسْتَغْفِرُ اللَّهَ رَبَّ الْبَرَايَا وَأَسْتَغْفِرُ اللَّهَ مِنَ الْخَطَايَا (4)',
    start: 364,
    end: 382,
  },
  {
    id: 24,
    text: 'فَاعْلَمْ أَنَّهُ – لَا إِلَهَ إِلَّا اللَّهُ- لَا إِلَهَ إِلَّا اللَّهُ  (25)',
    start: 382,
    end: 453,
  },
  {
    id: 25,
    text: 'لَا إِلَهَ إِلاَّ اللَّهُ مُحَمَّدٌ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمْ وَشَرَّفَ وَكَرَّمَ وَمَجَّدَ وَعَظَّمَ وَرَضِيَ اللَّهُ تَعَالَى عَنْ أَهْلِ بَيْتِهِ الطَّيِّبِينَ الطَّاهِرِينَ وأَصْحَابِهِ الْأَكْرَمِينَ وَأَزْوَاجِهِ الطَّاهِرَاتِ أُمَّهَاتِ الْمُؤْمِنِينَ وَالتَّابِعِينَ لَهُمْ بِإِحْسَانٍ إِلَى يَوْمِ الدِّينِ. وَعَلَيْنَا مَعَهُمْ وَفِيهِمْ بِرَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِينَ.',
    start: 453,
    end: 474,
  },
  {
    id: 26,
    text: 'سُورَةُ الْإِخْلاَصْ (3) سُورَةُ الْفَلَقْ سُورَةُ النَّاسْ',
    start: 474,
    end: 518,
  },
  {
    id: 27,
    text: 'لِسَيِّدِنَا الْفَقِيْهِ الْمُقَدَّمِ الشَّيْخِ مُحَمَّدِ بْنِ عَلِي بَاعَلَوِي وَأُصُولِهِ وَفُرُوعِهِ وَكَافَّةِ سَادَاتِنَا آلِ بَاعَلَوِي إِنَّ اللَّهَ يُعْلِي دَرَجَاتِهِمْ وَيَنْفَعُنَا بِهِمْ وَبِعُلُومِهِمْ وَأَسْرَارِهِمْ وَبَرَكَاتِهِمْ فِي الدِّينِ وَالدُّنْيَا وَالْآخِرَةِ.    الفاتحة', 
    start: 518,
    end: 552,
  },
  {
    id: 28,
    text: 'ثُمَّ إِلَى حَضَرَاتِ أَرْوَاحِ جَمِيعِ سَادَاتِنَا الصُّوفِيَّةِ أَيْنَمَا كَانُوا وَحَلَّتْ أَرْوَاحُهُمْ بِأَنَّ اللهَ يُعْلِي دَرَجَاتِهِمْ وَيَنْفَعُنَا بِهِمْ وَبِعُلُومِهِمْ وأَسْرَارِهِمْ وَيُلْحِقُنَا بِهِمْ في لُطفٍ وخَيْرٍ وَعَافِيَةٍ.    الفاتحة',
    start: 552,
    end: 584,
  },
  {
    id: 29,
    text: 'لِصَاحِبِ الرَّاتِبِ الْكَبِيرِ الْقُطْبِ الشَّهِيرِ الْحَبِيبِ عَبْدِ اللهِ بْنِ عَلَوِيِّ الْحَدَّادِ بَاعَلَوِي وَأُصُولِهِ وَفُرُوعِهِ بِأَنَّ اللهَ يُعْلِي دَرَجَاتِهِمْ فِي الْجَنَّةِ.    الفاتحة',
    start: 584,
    end: 612,
  },
  {
    id: 30,
    text: 'لِكَافَّةِ عِبَادِ اللهِ الصَّالِحينَ وَلِوَالِدِينَا وَلِكَافَّةِ الْمُسْلِمِينَ، إِنَّ اللهَ يَغْفِرُ لَهُمْ وَيَرْحَمُهُمْ ويُسْكِنُهُمْ فِي الْجَنَّة ِويُصْلِحُ أُمُورَ الْمُسْلِمِينَ ويَكْفِيهِمْ شَرَّ الْمُؤْذِينَ وَيَتَقَبَّلُ مِنَّا وَمِنْكُمْ وَيَرْزُقُنَا وإِيَّاكُمْ حُسْنَ الْخَاتِمَةِ عِنْدَ الْمَوْتِ فِي خَيْرٍ وَلُطْفٍ وَعَافِيَةٍ وَإِلىَ حَضْرَةِ النَّبِيِّ سَيِّدِنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلِّمْ.    الفاتحة',
    start: 612,
    end: 653,
  },
  {
    id: 31,
    text: 'الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ، حَمْدًا يُوَافِي نِعَمَهُ وَيُكَافِئُ مَزِيدَهُ، اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ وَآلِهِ وَصَحْبِهِ وَسَلِّمْ، اللَّهُمَّ إِنَّا نَسْأَلُكَ بِحَقِّ الْفَاتِحَةِ الْمُعَظَّمَةِ وَالسَّبْعِ الْمَثَانِي أَنْ تُفَتِّحَ لَنَا كُلَّ خَيْرٍ وَأَنْ تَتَفَضَّلَ عَلَيْنَا بِكُلِّ خَيْرٍ وَأَنْ تَجْعَلَنَا مِنْ أَهْلِ الْخَيْرِ، وَأَنْ تُعَامِلَنَا يَا مَوْلَانَا مُعَامَلَتَكَ لِأَهْلِ الْخَيْرِ، وَأَنْ تَحْفَظَنَا فِي أَدْيَانِنَا وَأَنْفُسِنَا وَأَهْلِينَا وَأَوْلَادِنَا وَأَصْحَابِنَا مِنْ كُلِّ مِحْنَةٍ وَفِتْنَةٍ وَبُؤْسٍ وَضَيْرٍ، إِنَّكَ وَلِيٌّ لِكُلِّ خَيْرٍ، وَمُتَفَضِّلٌ بِكُلِّ خَيْرٍ وَمُعْطٍ لِكُلِّ خَيْرٍ',
    start: 653,
    end: 690,
  },
  {
    id: 32,
    text: 'بِرَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِينَ (3)',
    start: 690,
    end: 695,
  },
  {
    id: 33,
    text: 'اللَّهُمَّ إِنَّا نَسْأَلُكَ رِضَاكَ وَالْجَنَّةَ وَنَعُوذُ بِكَ مِنْ سَخَطِكِ وَالنَّارِ (3)',
    start: 695,
    end: 707,
  },
  {
    id: 34,
    text: 'يَا عَالِمَ السِّرِّ مِنَّا لاَ تَهْتِكِ السِّتْرَ عَنَّا وَعَافِنَا وَاعْفُ عَنَّا وَكُنْ لَنَا حَيْثُ كُنَّا',
    start: 707,
    end: 721,
  },
  {
    id: 35,
    text: 'يارب هيّء لنا من أمرنا رشدا واجعل معونتك الحسنى لنا مددا',
    start: 721,
    end: 735,
  },
  {
    id: 36,
    text: 'يا حي يا قيوم احي القلوب تحيى واصلح لنا الاعمال في الدين والدنيا',
    start: 735,
    end: 748,
  },
  {
    id: 37,
    text: 'صَلَّى اللهُ عَــــلَى مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّـمْ (10)',
    start: 748,
    end: 775,
  },
];
